bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // If mount fails, explicitly format the filesystem first
  // This handles severely corrupted filesystems better than begin(true)
  if (!LittleFS.format()) {
    Serial.println("LittleFS format failed! Check partition table and flash configuration.");
    return;
  }

  Serial.println("LittleFS formatted successfully");

  // Now try to mount the freshly formatted filesystem
  if (!LittleFS.begin(false)) {
    Serial.println("Critical: Failed to mount LittleFS after successful format!");
    return;
  }

  Serial.println("LittleFS mounted successfully after format");
}

bool connectToMeshCore() {
  lastMeshConnectAttempt = millis();
  meshDeviceConnected = false;
  meshMessageCharacteristic = nullptr;
  meshChannelReady = false;

  Serial.printf("Scanning for MeshCore peer named '%s'...\n", BLE_PEER_NAME);

  BLEScan* scan = BLEDevice::getScan();
  scan->setActiveScan(true);
  BLEScanResults results = scan->start(5, false);

  for (int i = 0; i < results.getCount(); i++) {
    BLEAdvertisedDevice device = results.getDevice(i);
    if (device.getName() != BLE_PEER_NAME) {
      continue;
    }

    Serial.println("MeshCore peer found, attempting connection...");

    if (meshClient == nullptr) {
      meshClient = BLEDevice::createClient();
      meshClient->setClientCallbacks(new MeshClientCallbacks());
    }

    if (!meshClient->connect(&device)) {
      lastMeshError = "Connection attempt failed";
      continue;
    }

    // Allow MTU negotiation to complete before accessing services
    // This prevents GATT_BUSY errors (GATTC_ConfigureMTU GATT_BUSY)
    delay(BLE_MTU_NEGOTIATION_DELAY_MS);

    BLERemoteService* service = meshClient->getService(MESHCORE_SERVICE_UUID);
    if (service == nullptr) {
      lastMeshError = "MeshCore service not found on peer";
      meshClient->disconnect();
      continue;
    }

    BLERemoteCharacteristic* characteristic = service->getCharacteristic(MESHCORE_MESSAGE_CHAR_UUID);
    if (characteristic == nullptr) {
      lastMeshError = "MeshCore message characteristic missing";
      meshClient->disconnect();
      continue;
    }

    if (!characteristic->canWrite()) {
      lastMeshError = "MeshCore message characteristic is not writable";
      meshClient->disconnect();
      continue;
    }

    meshMessageCharacteristic = characteristic;
    meshDeviceConnected = true;
    lastMeshError = "";
    Serial.println("Connected to MeshCore peer and ready to send messages");
    if (!ensureMeshChannel()) {
      meshClient->disconnect();
      meshDeviceConnected = false;
      return false;
    }

    return true;
  }

  lastMeshError = "MeshCore peer not found during scan";
  return false;
}

void disconnectFromMeshCore() {
  if (meshClient != nullptr && meshClient->isConnected()) {
    Serial.println("Disconnecting from MeshCore...");
    meshClient->disconnect();
  }
  meshDeviceConnected = false;
  meshMessageCharacteristic = nullptr;
  meshChannelReady = false;
  
  // Deinitialize BLE to free resources for WiFi
  BLEDevice::deinit();
  Serial.println("BLE deinitialized");
}

void disconnectWiFi() {
  Serial.println("Disconnecting WiFi for BLE operation...");
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(100); // Allow WiFi to fully shut down
  Serial.println("WiFi disconnected");
}

void reconnectWiFi() {
  Serial.println("Reconnecting WiFi after BLE operation...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi reconnected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to reconnect to WiFi!");
  }
}

bool ensureMeshChannel() {
  if (meshChannelReady) {
    return true;
  }

  if (!meshDeviceConnected || meshMessageCharacteristic == nullptr) {
    return false;
  }

  if (!provisionMeshChannel()) {
    lastMeshError = "Mesh channel provisioning failed";
    return false;
  }

  meshChannelReady = true;
  return true;
}

bool provisionMeshChannel() {
  if (strlen(BLE_MESH_CHANNEL_NAME) == 0) {
    lastMeshError = "Mesh channel name missing";
    return false;
  }

  JsonDocument doc;
  doc["action"] = "ensure_channel";
  doc["channel"] = BLE_MESH_CHANNEL_NAME;
  doc["key"] = BLE_MESH_CHANNEL_KEY;

  String payload;
  serializeJson(doc, payload);

  Serial.printf("Provisioning MeshCore channel '%s'...\n", BLE_MESH_CHANNEL_NAME);
  try {
    meshMessageCharacteristic->writeValue(
      const_cast<uint8_t*>(reinterpret_cast<const uint8_t*>(payload.c_str())),
      payload.length(),
      false
    );
  } catch (...) {
    lastMeshError = "Failed to provision MeshCore channel";
    return false;
  }

  lastMeshError = "";

  return true;
}

void initWebServer() {

  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }
    request->send(200, "text/html", getWebPage());
  });

  server.on("/api/mesh/status", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["connected"] = meshDeviceConnected;
    doc["peerName"] = BLE_PEER_NAME;
    doc["deviceName"] = BLE_DEVICE_NAME;
    doc["channel"] = BLE_MESH_CHANNEL_NAME;
    doc["channelReady"] = meshChannelReady;
    doc["lastError"] = lastMeshError;
    doc["bleOperationInProgress"] = bleOperationInProgress;
    doc["monitoringPaused"] = monitoringPaused;

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  server.on("/api/mesh/send", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

      // Check if a BLE operation is already in progress
      if (bleOperationInProgress) {
        request->send(503, "application/json", "{\"error\":\"BLE operation already in progress\"}");
        return;
      }

      JsonDocument doc;
      if (deserializeJson(doc, data, len) != DeserializationError::Ok) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

