bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // import services configuration
  server.on("/api/import", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }
      // Limit payload size to 16KB to prevent DoS
      if (total > 16384) {
        request->send(400, "application/json", "{\"error\":\"Payload too large\"}");
        return;
      }

      JsonDocument doc;
      DeserializationError error = deserializeJson(doc, data, len);

      if (error) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      JsonArray array = doc["services"];
      if (array.isNull()) {
        request->send(400, "application/json", "{\"error\":\"Missing services array\"}");
        return;
      }

      int importedCount = 0;
      int skippedCount = 0;

      for (JsonObject obj : array) {
        if (serviceCount >= MAX_SERVICES) {
          skippedCount++;
          continue;
        }

        // Validate required fields
        String name = obj["name"].as<String>();
        String host = obj["host"].as<String>();
        if (name.length() == 0 || host.length() == 0) {
          skippedCount++;
          continue;
        }

        String typeStr = obj["type"].as<String>();
        ServiceType type;
        if (typeStr == "home_assistant") {
          type = TYPE_HOME_ASSISTANT;
        } else if (typeStr == "jellyfin") {
          type = TYPE_JELLYFIN;
        } else if (typeStr == "http_get") {
          type = TYPE_HTTP_GET;
        } else if (typeStr == "ping") {
          type = TYPE_PING;
        } else {
          skippedCount++;
          continue;
        }

        // Validate and constrain numeric values
        int port = obj["port"] | 80;
        if (port < 1 || port > 65535) port = 80;

        int checkInterval = obj["checkInterval"] | 60;
        if (checkInterval < 10) checkInterval = 10;

        int passThreshold = obj["passThreshold"] | 1;
        if (passThreshold < 1) passThreshold = 1;

        int failThreshold = obj["failThreshold"] | 1;
        if (failThreshold < 1) failThreshold = 1;

        Service newService;
        newService.id = generateServiceId();
        newService.name = name;
        newService.type = type;
        newService.host = host;
        newService.port = port;
        newService.path = obj["path"] | "/";
        newService.expectedResponse = obj["expectedResponse"] | "*";
        newService.checkInterval = checkInterval;
        newService.passThreshold = passThreshold;
        newService.failThreshold = failThreshold;
        newService.consecutivePasses = 0;
        newService.consecutiveFails = 0;
        newService.isUp = false;
        newService.lastCheck = 0;
        newService.lastUptime = 0;
        newService.lastError = "";
        newService.secondsSinceLastCheck = -1;

        services[serviceCount++] = newService;
        importedCount++;
      }

      saveServices();

      JsonDocument response;
      response["success"] = true;
      response["imported"] = importedCount;
      response["skipped"] = skippedCount;

      String responseStr;
      serializeJson(response, responseStr);
      request->send(200, "application/json", responseStr);
    }
  );

  server.begin();
  Serial.println("Web server started");
}

String generateServiceId() {
  return String(millis()) + String(random(1000, 9999));
}

void checkServices() {
  unsigned long currentTime = millis();

  for (int i = 0; i < serviceCount; i++) {
    // Check if it's time to check this service
    if (currentTime - services[i].lastCheck < services[i].checkInterval * 1000) {
      continue;
    }

    bool firstCheck = services[i].lastCheck == 0;
    services[i].lastCheck = currentTime;
    bool wasUp = services[i].isUp;

    // Perform the actual check
    bool checkResult = false;
    switch (services[i].type) {
      case TYPE_HOME_ASSISTANT:
        checkResult = checkHomeAssistant(services[i]);
        break;
      case TYPE_JELLYFIN:
        checkResult = checkJellyfin(services[i]);
        break;
      case TYPE_HTTP_GET:
        checkResult = checkHttpGet(services[i]);
        break;
      case TYPE_PING:
        checkResult = checkPing(services[i]);
        break;
    }

    // Update consecutive counters based on check result
    if (checkResult) {
      services[i].consecutivePasses++;
      services[i].consecutiveFails = 0;
      services[i].lastUptime = currentTime;
      services[i].lastError = "";
    } else {
      services[i].consecutiveFails++;
      services[i].consecutivePasses = 0;
    }

    // Determine new state based on thresholds
    if (!services[i].isUp && services[i].consecutivePasses >= services[i].passThreshold) {
      // Service has passed enough times to be considered UP
      services[i].isUp = true;
    } else if (services[i].isUp && services[i].consecutiveFails >= services[i].failThreshold) {
      // Service has failed enough times to be considered DOWN
      services[i].isUp = false;
    }

    // Log and notify on state changes
    if (wasUp != services[i].isUp) {
      Serial.printf("Service '%s' is now %s (after %d consecutive %s)\n",
        services[i].name.c_str(),
        services[i].isUp ? "UP" : "DOWN",
        services[i].isUp ? services[i].consecutivePasses : services[i].consecutiveFails,
        services[i].isUp ? "passes" : "fails");

      if (!services[i].isUp) {
        sendOfflineNotification(services[i]);
      } else if (!firstCheck) {
        sendOnlineNotification(services[i]);
      }
    }
  }
}

// technically just detectes any endpoint, so would be good to support auth and check if it's actually home assistant
// could parse /api/states or something to check there are valid entities and that it's actually HA
bool checkHomeAssistant(Service& service) {
  HTTPClient http;
  String url = "http://" + service.host + ":" + String(service.port) + "/api/";

  http.begin(url);
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
      // HA returns 404 for /api/, but ANY positive HTTP status means the service is alive
      isUp = true;
  } else {
      service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

