bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
bool checkJellyfin(Service& service) {
  HTTPClient http;
  String url = "http://" + service.host + ":" + String(service.port) + "/health";

  http.begin(url);
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      isUp = true;
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkHttpGet(Service& service) {
  HTTPClient http;
  String url = "http://" + service.host + ":" + String(service.port) + service.path;

  http.begin(url);
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      if (service.expectedResponse == "*") {
        isUp = true;
      } else {
        String payload = http.getString();
        isUp = payload.indexOf(service.expectedResponse) >= 0;
        if (!isUp) {
          service.lastError = "Response mismatch";
        }
      }
    } else {
      service.lastError = "HTTP " + String(httpCode);
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkPing(Service& service) {
  bool success = Ping.ping(service.host.c_str(), 3);
  if (!success) {
    service.lastError = "Ping timeout";
  }
  return success;
}

void sendOfflineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured() && !meshDeviceConnected) {
    return;
  }

  bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String title = "Service DOWN: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0) {
    message += ":" + String(service.port);
  }
  message += " is offline.";

  if (service.lastError.length() > 0) {
    message += " Error: " + service.lastError;
  }

  if (wifiConnected) {
    if (isNtfyConfigured()) {
      sendNtfyNotification(title, message, "warning,monitor");
    }

    if (isDiscordConfigured()) {
      sendDiscordNotification(title, message);
    }

    if (isSmtpConfigured()) {
      sendSmtpNotification(title, message);
    }
  } else {
    Serial.println("WiFi offline: skipping internet notifications");
  }

  sendMeshCoreNotification(title, message);
}

void sendOnlineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured() && !meshDeviceConnected) {
    return;
  }

  bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String title = "Service UP: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0) {
    message += ":" + String(service.port);
  }
  message += " is back online.";

  if (wifiConnected) {
    if (isNtfyConfigured()) {
      sendNtfyNotification(title, message, "ok,monitor");
    }

    if (isDiscordConfigured()) {
      sendDiscordNotification(title, message);
    }

    if (isSmtpConfigured()) {
      sendSmtpNotification(title, message);
    }
  } else {
    Serial.println("WiFi offline: skipping internet notifications");
  }

  sendMeshCoreNotification(title, message);
}

void sendNtfyNotification(const String& title, const String& message, const String& tags) {
  HTTPClient http;
  String url = String(NTFY_SERVER) + "/" + NTFY_TOPIC;

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }
  http.addHeader("Title", title);
  http.addHeader("Tags", tags);
  http.addHeader("Content-Type", "text/plain");

  if (strlen(NTFY_ACCESS_TOKEN) > 0) {
    http.addHeader("Authorization", "Bearer " + String(NTFY_ACCESS_TOKEN));
  } else if (strlen(NTFY_USERNAME) > 0) {
    http.setAuthorization(NTFY_USERNAME, NTFY_PASSWORD);
  }

  int httpCode = http.POST(message);

  if (httpCode > 0) {
    Serial.printf("ntfy notification sent: %d\n", httpCode);
  } else {
    Serial.printf("Failed to send ntfy notification: %d\n", httpCode);
  }

  http.end();
}

void sendDiscordNotification(const String& title, const String& message) {
  HTTPClient http;
  String url = String(DISCORD_WEBHOOK_URL);

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }

  http.addHeader("Content-Type", "application/json");

  JsonDocument doc;
  doc["content"] = "**" + title + "**\n" + message;

  String payload;
  serializeJson(doc, payload);

  int httpCode = http.POST(payload);

  if (httpCode > 0) {
    Serial.printf("Discord notification sent: %d\n", httpCode);
  } else {
    Serial.printf("Failed to send Discord notification: %d\n", httpCode);
  }

  http.end();
}

void sendMeshCoreNotification(const String& title, const String& message) {
  // ESP32-S3 cannot run WiFi and BLE simultaneously
  // Disconnect WiFi, connect BLE, send message, disconnect BLE, reconnect WiFi
  
  Serial.println("Starting MeshCore notification (BLE operation)...");
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Initialize BLE (on-demand, since we deinit after each use)
  initBLE();
  
  // Try to connect and send message
  if (meshDeviceConnected && meshMessageCharacteristic != nullptr) {
    if (ensureMeshChannel()) {
      JsonDocument doc;
      doc["channel"] = BLE_MESH_CHANNEL_NAME;
      doc["key"] = BLE_MESH_CHANNEL_KEY;
      doc["title"] = title;
      doc["body"] = message;

      String payload;
      serializeJson(doc, payload);

      try {
        meshMessageCharacteristic->writeValue(
          const_cast<uint8_t*>(reinterpret_cast<const uint8_t*>(payload.c_str())),
          payload.length(),
          false
        );
        Serial.println("MeshCore notification sent successfully");
      } catch (...) {
        Serial.println("MeshCore notification failed: write error");
      }
    } else {
      Serial.println("MeshCore notification skipped: channel not ready");
    }
  } else {
    Serial.println("MeshCore notification skipped: not connected");
  }
  
